moore_test_suite/logs/performance/22222/20260128_Qwen3-235B-A22B_DynamicSplitFuseV2_swap-space.log
Looking in indexes: https://pypi.tuna.tsinghua.edu.cn/simple
Requirement already satisfied: dataSets in /usr/local/lib/python3.10/dist-packages (4.4.1)
Requirement already satisfied: pillow in /usr/local/lib/python3.10/dist-packages (11.2.1)
Requirement already satisfied: aiohttp in /usr/local/lib/python3.10/dist-packages (3.13.0)
Requirement already satisfied: pyarrow>=21.0.0 in /usr/local/lib/python3.10/dist-packages (from dataSets) (22.0.0)
Requirement already satisfied: fsspec[http]<=2025.10.0,>=2023.1.0 in /usr/local/lib/python3.10/dist-packages (from dataSets) (2025.10.0)
Requirement already satisfied: pandas in /usr/local/lib/python3.10/dist-packages (from dataSets) (2.3.3)
Requirement already satisfied: dill<0.4.1,>=0.3.0 in /usr/local/lib/python3.10/dist-packages (from dataSets) (0.4.0)
Requirement already satisfied: huggingface-hub<2.0,>=0.25.0 in /usr/local/lib/python3.10/dist-packages (from dataSets) (0.36.0)
Requirement already satisfied: httpx<1.0.0 in /usr/local/lib/python3.10/dist-packages (from dataSets) (0.28.1)
Requirement already satisfied: tqdm>=4.66.3 in /usr/local/lib/python3.10/dist-packages (from dataSets) (4.66.3)
Requirement already satisfied: xxhash in /usr/local/lib/python3.10/dist-packages (from dataSets) (3.6.0)
Requirement already satisfied: multiprocess<0.70.19 in /usr/local/lib/python3.10/dist-packages (from dataSets) (0.70.18)
Requirement already satisfied: pyyaml>=5.1 in /usr/local/lib/python3.10/dist-packages (from dataSets) (6.0.3)
Requirement already satisfied: requests>=2.32.2 in /usr/local/lib/python3.10/dist-packages (from dataSets) (2.32.5)
Requirement already satisfied: packaging in /usr/local/lib/python3.10/dist-packages (from dataSets) (25.0)
Requirement already satisfied: numpy>=1.17 in /usr/local/lib/python3.10/dist-packages (from dataSets) (1.24.3)
Requirement already satisfied: filelock in /usr/local/lib/python3.10/dist-packages (from dataSets) (3.20.0)
Requirement already satisfied: attrs>=17.3.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (25.4.0)
Requirement already satisfied: propcache>=0.2.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (0.4.1)
Requirement already satisfied: frozenlist>=1.1.1 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (1.8.0)
Requirement already satisfied: multidict<7.0,>=4.5 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (6.7.0)
Requirement already satisfied: async-timeout<6.0,>=4.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (5.0.1)
Requirement already satisfied: yarl<2.0,>=1.17.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (1.22.0)
Requirement already satisfied: aiosignal>=1.4.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (1.4.0)
Requirement already satisfied: aiohappyeyeballs>=2.5.0 in /usr/local/lib/python3.10/dist-packages (from aiohttp) (2.6.1)
Requirement already satisfied: typing-extensions>=4.2 in /usr/local/lib/python3.10/dist-packages (from aiosignal>=1.4.0->aiohttp) (4.13.2)
Requirement already satisfied: certifi in /usr/local/lib/python3.10/dist-packages (from httpx<1.0.0->dataSets) (2025.11.12)
Requirement already satisfied: idna in /usr/local/lib/python3.10/dist-packages (from httpx<1.0.0->dataSets) (3.11)
Requirement already satisfied: httpcore==1.* in /usr/local/lib/python3.10/dist-packages (from httpx<1.0.0->dataSets) (1.0.9)
Requirement already satisfied: anyio in /usr/local/lib/python3.10/dist-packages (from httpx<1.0.0->dataSets) (4.11.0)
Requirement already satisfied: h11>=0.16 in /usr/local/lib/python3.10/dist-packages (from httpcore==1.*->httpx<1.0.0->dataSets) (0.16.0)
Requirement already satisfied: hf-xet<2.0.0,>=1.1.3 in /usr/local/lib/python3.10/dist-packages (from huggingface-hub<2.0,>=0.25.0->dataSets) (1.2.0)
Requirement already satisfied: charset_normalizer<4,>=2 in /usr/local/lib/python3.10/dist-packages (from requests>=2.32.2->dataSets) (3.4.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in /usr/local/lib/python3.10/dist-packages (from requests>=2.32.2->dataSets) (2.5.0)
Requirement already satisfied: tzdata>=2022.7 in /usr/local/lib/python3.10/dist-packages (from pandas->dataSets) (2025.2)
Requirement already satisfied: pytz>=2020.1 in /usr/local/lib/python3.10/dist-packages (from pandas->dataSets) (2025.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /usr/local/lib/python3.10/dist-packages (from pandas->dataSets) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.2->pandas->dataSets) (1.16.0)
Requirement already satisfied: exceptiongroup>=1.0.2 in /usr/local/lib/python3.10/dist-packages (from anyio->httpx<1.0.0->dataSets) (1.3.0)
Requirement already satisfied: sniffio>=1.1 in /usr/local/lib/python3.10/dist-packages (from anyio->httpx<1.0.0->dataSets) (1.3.1)
========================================================
Random Testing input=128, output=1024
========================================================
Testing concurrency=1, prompts=4
python3 /SigInfer/script/benchmark/benchmark_serving.py --backend openai --port 20000 --host 10.0.0.40 --model Qwen3-235B-A22B --tokenizer /home/weight/Qwen3/Qwen3-235B-A22B/ --endpoint /v1/completions --dataset-name random --random-input-len 128 --random-output-len 1024 --num-prompts 4 --request-rate inf --max-concurrency 1 --ignore-eos
Namespace(backend='openai', base_url=None, host='10.0.0.40', port=20000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='Qwen3-235B-A22B', tokenizer='/home/weight/Qwen3/Qwen3-235B-A22B/', use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  128.35    
Total input tokens:                      512       
Total generated tokens:                  4096      
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         31.91     
Total Token throughput (tok/s):          35.90     
---------------Time to First Token----------------
Mean TTFT (ms):                          94.34     
Median TTFT (ms):                        93.59     
P99 TTFT (ms):                           100.27    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.27     
Median TPOT (ms):                        31.27     
P99 TPOT (ms):                           31.37     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.27     
Median ITL (ms):                         30.76     
P99 ITL (ms):                            41.04     
==================================================
========================================================
Random Testing input=1024, output=4096
========================================================
Testing concurrency=1, prompts=4
python3 /SigInfer/script/benchmark/benchmark_serving.py --backend openai --port 20000 --host 10.0.0.40 --model Qwen3-235B-A22B --tokenizer /home/weight/Qwen3/Qwen3-235B-A22B/ --endpoint /v1/completions --dataset-name random --random-input-len 1024 --random-output-len 4096 --num-prompts 4 --request-rate inf --max-concurrency 1 --ignore-eos
Namespace(backend='openai', base_url=None, host='10.0.0.40', port=20000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=1, model='Qwen3-235B-A22B', tokenizer='/home/weight/Qwen3/Qwen3-235B-A22B/', use_beam_search=False, num_prompts=4, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=4096, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
============ Serving Benchmark Result ============
Successful requests:                     4         
Benchmark duration (s):                  513.92    
Total input tokens:                      4096      
Total generated tokens:                  16384     
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         31.88     
Total Token throughput (tok/s):          39.85     
---------------Time to First Token----------------
Mean TTFT (ms):                          173.14    
Median TTFT (ms):                        175.08    
P99 TTFT (ms):                           176.96    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.33     
Median TPOT (ms):                        31.32     
P99 TPOT (ms):                           31.44     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.33     
Median ITL (ms):                         30.85     
P99 ITL (ms):                            41.18     
==================================================